
export interface TopicStructure {
  [chapter: string]: string[];
}

export interface SyllabusDB {
  [subject: string]: TopicStructure;
}

export const SYLLABUS_DB: SyllabusDB = {
  'Bangla 1st Paper': {
    'গদ্য': [
      'সাহিত্যের খেলা', 'গন্তব্য কাবুল', 'অর্ধাঙ্গী', 'যৌবনের গান', 'কপিলদাস মুর্মুর শেষ কাজ',
      'বিড়াল', 'বাঙ্গালার নব্য লেখকদের প্রতি নিবেদন', 'অপরিচিতা', 'বিলাসী', 'গৃহ',
      'আহ্বান', 'আমার পথ', 'মানব কল্যাণ', 'জীবন ও বৃক্ষ', 'মাসি-পিসি',
      'বায়ান্নর দিনগুলো', 'জাদুঘরে কেন যাব', 'রেইনকোট', 'মহাজাগতিক কিউরেটর', 'নেকলেস', 'চাষার দুঃখ'
    ],
    'পদ্য': [
      'প্রত্যাবর্তনের লজ্জা', 'ঋতু বর্ণন', 'বিভীষণের প্রতি মেঘনাদ', 'সোনার তরী', 'ঐকতান',
      'বিদ্রোহী', 'সাম্যবাদী', 'প্রতিদান', 'সুচেতনা', 'তাহারেই পড়ে মনে',
      'সেই অস্ত্র', 'পদ্মা', 'আঠারো বছর বয়স', 'ফেব্রুয়ারি ১৯৬৯', 'আমি কিংবদন্তির কথা বলছি',
      'নূরলদীনের কথা মনে পড়ে যায়', 'ছবি', 'এই পৃথিবীতে এক স্থান আছে', 'রক্তে আমার অনাদি অস্থি', 'লোক-লোকান্তর'
    ],
    'উপন্যাস': ['লালসালু'],
    'নাটক': ['সিরাজউদ্দৌলা']
  },
  'Bangla 2nd Paper': {
    'ব্যাকরণ': [
      'বাংলা উচ্চারণের নিয়ম', 'বাংলা বানানের নিয়ম', 'ব্যাকরণিক শব্দশ্রেণি',
      'শব্দ গঠন (উপসর্গ, সমাস)', 'বাক্যতত্ত্ব', 'বাংলা ভাষার অপপ্রয়োগ ও শুদ্ধ প্রয়োগ', 'পারিভাষিক শব্দ'
    ],
    'নির্মিতি': [
      'অনুবাদ', 'দিনলিপি ও প্রতিবেদন', 'বৈদ্যুতিন চিঠি ও আবেদনপত্র',
      'সারাংশ ও সারমর্ম', 'ভাবসম্প্রসারণ', 'সংলাপ ও ক্ষুদেগল্প', 'প্রবন্ধ রচনা'
    ]
  },
  'Biology 1st Paper': {
    'কোষ ও এর গঠন': [
      'কোষ, কোষ প্রাচীর, প্রোটোপ্লাস্ট',
      'প্লাজমামেমব্রেন ও সাইটোপ্লাজম',
      'রাইবোজোম, গলজিবস্তু ও লাইসোজোম',
      'এন্ডোপ্লাজমিক রেটিকুলাম, কোষী...',
      'প্লাস্টিড ও নিউক্লিয়াস',
      'ক্রোমোজোম,নিউক্লিক এসিড, DNA...',
      'DNA রেপ্লিকেশন, ট্রান্সক্রিপশন ও...',
      'জিন ও জেনেটিক কোড'
    ],
    'কোষ বিভাজন': [
      'অ্যামাইটোসিস,মাইটোসিস,কোষ চক্র',
      'মাইটোসিস ও এর ধাপ',
      'মায়োসিস ও এর ধাপ',
      'ক্রসিং ওভার'
    ],
    'কোষ রসায়ন': [
      'কার্বোহাইড্রেট',
      'অ্যামিনো এসিড ও প্রোটিন',
      'লিপিড',
      'উৎসেচক বা এনজাইম'
    ],
    'অণুজীব': [
      'ভাইরাসের বৈশিষ্ট্য, গঠন প্রকারভেদ ...',
      'ব্যাকটেরিওফাজ ও ভাইরাসজনিত...',
      'ব্যাকটেরিয়ার গঠন,প্রকারভেদ ...',
      'ব্যাকটেরিয়ার উপকারিতা, অপকারিতা...',
      'ম্যালেরিয়ার পরজীবী ও এর জীবনচক্র'
    ],
    'শৈবাল ও ছত্রাক': [
      'শৈবালের বৈশিষ্ট্য, জনন , গঠন...',
      'Ulothrix এর আবাস, গঠন ও জনন',
      'ছত্রাকের বৈশিষ্ট্য, গঠন, প্রজনন ...',
      'Agaricus এর আবাস,গঠন , জনন ...',
      'ছত্রাকঘটিত রোগের কারণ, লক্ষণ...',
      'শৈবাল ও ছত্রাকের সহাবস্থান'
    ],
    'ব্রায়োফাইটা ও টেরিডোফাইটা': [
      'ব্রায়োফাইটা এবং Riccia এর আবা...',
      'টেরিডোফাইটা এবং Pteris এ...'
    ],
    'নগ্নবীজী ও আবৃতবীজী উদ্ভিদ': [
      'নগ্নবীজী উদ্ভিদ এবং Cycas গঠন ...',
      'আবৃতবীজী উদ্ভিদ,স্বরূপ ,মূল কান্ড ...',
      'পুষ্পপত্রবিন্যাস,পুষ্পপুট,অমরাবিন্যাস...',
      'Poaceae ও Malvaceae গোত্রে...'
    ],
    'টিস্যু ও টিস্যুতন্ত্র': [
      'ভাজক টিস্যু ও স্থায়ী টিস্যু',
      'এপিডার্মাল, গ্রাউন্ড টিস্যুতন্ত্রে...',
      'ভাস্কুলার টিস্যুতন্ত্র',
      'একবীজপত্রী ও দ্বিবীজপত্রী উদ্ভিদে...'
    ],
    'উদ্ভিদ শারীরতত্ত্ব': [
      'উদ্ভিদের খনিজ লবণ শোষণ প্রক্রি...',
      'প্রস্বেদন, পত্ররন্ধ্রের গঠন বর্ণনা ...',
      'ক্যালভিন চক্র ও হ্যাচ এন্ড স্ল্যাক চক্র',
      'সালোকসংশ্লেষণ প্রক্রিয়া ও লিমি...',
      'সবাত শ্বসন',
      'অবাত শ্বসন'
    ],
    'উদ্ভিদ প্রজনন': [
      'যৌন জনন ও নিষেক',
      'উদ্ভিদের অযৌন প্রক্রিয়া',
      'উদ্ভিদের সংকরায়ন',
      'কৃত্রিম প্রজননের গুরুত্ব'
    ],
    'জীব প্রযুক্তি': [
      'টিস্যুকালচার প্রযুক্তি',
      'জেনেটিক ইঞ্জিনিয়ারিং ও জিন ক্লোনিং',
      'রিকম্বিন্যান্ট ডিএনএ প্রযুক্তি',
      'জিনোম সিকোয়েন্সিং ও জীব প্রযুক্তির...'
    ],
    'বিস্তার ও সংরক্ষণ,জীবের পরিবেশ': [
      'প্রজাতি, জীবগোষ্ঠী ও জীবসম্প্রদা...',
      'জলজ, মরুজ ও লবনাক্ত পরিবে...',
      'বায়োম ও প্রাণিভৌগোলিক অঞ্চলসমূহ',
      'বাংলাদেশের বনাঞ্চল ও বনাঞ্চলে...',
      'বিলুপ্তপ্রায় জীব, বিলুপ্তির কারণ ...',
      'জীববৈচিত্র্য সংরক্ষণ পদ্ধতি ও গুরুত্ব'
    ]
  },
  'Biology 2nd Paper': {
    'প্রাণীর ভিন্নতা ও শ্রেণিবিন্যাস': [
      'প্রাণিজগতের ভিন্নতা, শ্রেণিবিন্যাসে...',
      'পরিফেরা ও নিডারিয়া',
      'প্লাটিহেলমিনথিস ও নেমাটোডা',
      'এনিলিডা ও মলাস্কা',
      'আর্থ্রোপোডা, একাইনোডার্মাটা ...',
      'কর্ডাটা পর্বের শ্রেণিবিন্যাস ...'
    ],
    'প্রাণীর পরিচিতি': [
      'হাইড্রার গঠন',
      'হাইড্রার খাদ্য গ্রহণ ও পরিপাক প্রক্রিয়া',
      'হাইড্রার চলন ও জনন পদ্ধতি এ...',
      'ঘাসফড়িং এর গঠন',
      'ঘাসফড়িংএর চলন,শ্রমবন্টন,পরিপা...',
      'ঘাসফড়িং এর সংবহন, শ্বসন ও রেচ...',
      'ঘাসফড়িং এর প্রজনন প্রক্রিয়া ...',
      'রুই মাছের গঠন',
      'রুই মাছের রক্ত সংবহন তন্ত্র, শ্বসনত...',
      'প্রকৃতিতে রুই মাছের প্রজনন, নিষে...'
    ],
    'পরিপাক ও শোষণ': [
      'পরিপাক, মুখগহ্বর ও পাকস্থলীর খা...',
      'যকৃত ,এর সঞ্চয়ী এবং বিপাকী...',
      'অগ্ন্যাশয়ের কার্যক্রম ও গ্যাস্ট্রিক জু...',
      'খাদ্যদ্রব্য পরিপাকে ও শোষণে ক্ষুদ্রা...'
    ],
    'রক্ত ও সঞ্চালন': [
      'রক্ত ও রক্ত কণিকা',
      'রক্ত জমাট বাধা, প্লাজমা ও লসিকা তন্ত্র',
      'হৃদপিণ্ড,কপাটিকা এবং কার্ডিয়াক চক্র',
      'জাংশনাল টিস্যু ও ব্যারোরিসেপ্টর এ...',
      'হৃদরোগ'
    ],
    'শ্বাসক্রিয়া ও শ্বসন': [
      'মানুষের শ্বসন তন্ত্রের বিভিন্ন অংশে...',
      'প্রশ্বাস নিঃশ্বাস এবং অক্সিজেন ও কা...',
      'শ্বাসনালীর সংক্রমণের কারণ, লক্ষ...'
    ],
    'বর্জ্য নিষ্কাশন': [
      'বৃক্কের গঠন ও কাজ,রেচনে...',
      'মূত্র,বৃক্ক বিকল,ডায়ালাইসিস,বৃ...'
    ],
    'চলন ও অঙ্গচালনা': [
      'মানুষের কঙ্কালতন্ত্রের কা...',
      'উপাঙ্গীয় কঙ্কাল',
      'অস্থি ও তরুণাস্থি',
      'পেশির গঠন, প্রকারভেদ ও কাজ এ...',
      'অস্থিভঙ্গ ও অস্থিসন্ধিতে আঘাত এ...'
    ],
    'সমন্বয় ও নিয়ন্ত্রণ': [
      'নিউরন, স্নায়ুতন্ত্রে...',
      'করোটিক স্নায়ু ও এদের কাজ',
      'মানব সংবেদী অঙ্গ: চোখ',
      'মানব সংবেদী অঙ্গ: কান',
      'অন্তঃক্ষরা গ্রন্থিসমূহের অবস্তা...'
    ],
    'মানব জীবনের ধারাবাহিকতা': [
      'পুরুষ ও স্ত্রী প্রজননতন্ত্র ও এ...',
      'প্রজননের বিভিন্ন পর্যায় ও দ...',
      'প্রজননের বিভিন্ন পর্যায় ও দ...',
      'গর্ভাবস্থায় করণীয়তা, গর্ভনিরোধ...',
      'প্রজনন জনিত সমস্যা, যৌনবাহি...'
    ],
    'মানবদেহের প্রতিরক্ষা': [
      'মানবদেহের প্রতিরক্ষা ব্যবস্থার ধার...',
      'ম্যাক্রোফেজ,নিউট্রোফিলস ...',
      'মানবদেহের সহজাত ওর্জি...',
      'অ্যান্টিবডি ও টিকা'
    ],
    'জিনতত্ত্ব ও বিবর্তন': [
      'মেন্ডেলিয়ান ইনহেরিট্যান্স সূত্রাব...',
      'মেন্ডেলের সূত্রের ব্যতিক্রমসমূহ ...',
      'লিঙ্গ নির্ধারণ নীতি, সেক্সলিঙ্ক...',
      'বিবর্তনতত্ত্বের ধারণা ও বিবর্তনে...'
    ],
    'প্রাণীর আচরণ': [
      'আচরণের প্রকৃতি ও সহজাত আচরণ...',
      'সহজাত আচরণ(ইনসটিংক্টস)',
      'কুকুরের লালার প্রতিবর্তী ক্রিয়া...'
    ]
  },
  'Physics 1st Paper': {
    'ভৌতজগত ও পরিমাপ': [
      'মাত্রা ও একক বিষয়ক',
      'ত্রুটি নির্ণয়',
      'ভার্নিয়ার স্কেল, স্ক্রু-গজ, স্ফেরোমিটার'
    ],
    'ভেক্টর': [
      'ভেক্টর রাশি প্রকারভেদ ও সূত্রাবলী',
      'লব্ধি ও মান নির্ণয়',
      'কোণ ও দিক নির্ণয়',
      'আপেক্ষিক বেগ',
      'ডট / ক্রস গুণন',
      'উপাংশ, বিভাজন ও অভিক্ষেপ',
      'ক্ষেত্রফল আয়তন',
      'ভেক্টর ক্যালকুলাস, গ্রেডিয়েন্ট...',
      'বৃষ্টি, গাড়ি ও মানুষ',
      'নদী ও নৌকা'
    ],
    'গতিবিদ্যা': [
      'প্রসঙ্গ কাঠামো',
      'গতি বিষয়ক রাশিমালা',
      'আপেক্ষিক গতি',
      'গতি সংক্রান্ত লেখচিত্র',
      'প্রক্ষেপক বা প্রাসের গতি',
      'বৃত্তীয় গতি'
    ],
    'নিউটনিয়ান বলবিদ্যা': [
      'মৌলিক বল',
      'নিউটনের গতিসূত্র',
      'বলের ঘাত ও ঘাত বল এবং ভরবেগ',
      'সংঘর্ষ',
      'বন্দুকের গুলি ছোড়া',
      'লিফট',
      'রকেটের গতি',
      'ঘর্ষণ , পুলি কপিকল ও ব্লক টানা ঠেলা',
      'ঘূর্ণন গতি',
      'জড়তার ভ্রামক ও চক্রগতির ব্যাসার্ধ',
      'কৌণিক ভরবেগ এবং গতিশক্তি ...',
      'টর্ক',
      'কেন্দ্রমুখী ও কেন্দ্রবিমুখী বল',
      'রাস্তার/রেললাইনের বাঁক'
    ],
    'কাজ, ক্ষমতা, ও শক্তি': [
      'কাজ',
      'শক্তি',
      'শক্তির নিত্যতা',
      'স্প্রিং',
      'সংরক্ষণশীল ও অসংরক্ষণশীল বল',
      'ক্ষমতা ও কর্মদক্ষতা',
      'অভিকর্ষ বল দ্বারা কৃতকাজ'
    ],
    'মহাকর্ষ ও অভিকর্ষ': [
      'অভিকর্ষ ও অভিকর্ষজ ত্বরণ',
      'মহাকর্ষীয় প্রাবল্য ও বিভব',
      'কেপলারের সূত্র',
      'অভিকর্ষজ ত্বরণ g এর পরিবর্তন',
      'অভিকর্ষ কেন্দ্র বা ভারকেন্দ্র',
      'মহাকর্ষীয় বলের সূত্রের ব্যবহার',
      'পড়ন্ত বস্তু',
      'মুক্তিবেগ',
      'উপগ্রহের বেগ, পর্যায়কাল ও উচ্চতা'
    ],
    'পদার্থের গাঠনিক ধর্ম': [
      'পদার্থের আন্তঃআণবিক বল',
      'স্থিতিস্থাপকতা',
      'পীড়ন-বিকৃতি',
      'হুকের সূত্র',
      'পয়সনের অনুপাত',
      'প্রবাহীর প্রবাহ',
      'সান্দ্রতা ও স্টোকসের সূত্র',
      'পৃষ্ঠটান ও পৃষ্ঠশক্তি',
      'কৈশিকতা ও স্পর্শ কোণ'
    ],
    'পর্যাবৃত্ত গতি': [
      'পর্যাবৃত্ত ও পর্যাবৃত্ত গতি',
      'সরল দোলান গতি',
      'সরল দোলান গতির ক্ষেত্রে শক্তি',
      'স্প্রিং এর দোলন',
      'সরল দোলকের সাহায্যে g এর মা...',
      'পাহাড়ের উচ্চতা নির্ণয়',
      'দোলক ঘড়ি দ্রুত বা ধীরে যাওয়া'
    ],
    'তরঙ্গ': [
      'তরঙ্গের মৌলিক বিষয়বস্তু',
      'তরঙ্গের সমীকরণ, দশা ও দশা পার্থক্য',
      'তরঙ্গ বেগ, তরঙ্গদৈর্ঘ্য ও কম্পাঙ্ক',
      'তরঙ্গের প্রকারভেদ',
      'তীব্রতা',
      'বিট',
      'হারমোনিক ও স্বরগ্রাম',
      'সুশ্রাব্য শব্দ'
    ],
    'আদর্শ গ্যাস ও গ্যাসের গতিতত্ত্ব': [
      'আদর্শ গ্যাস',
      'গ্যাস সূত্রাবলি',
      'প্রমাণ তাপমাত্রা ও চাপ',
      'গ্যাসের অণুর মৌলিক স্বীকার্যসমূহ ...',
      'গ্যাস ধ্রুবক',
      'গ্যাসের গতিশক্তি',
      'গড়বেগ, গড়বর্গ বেগ, মূল গড়বর্গ বে...',
      'স্বাধীনতার মাত্রা',
      'সম্পৃক্ত ও অসম্পৃক্ত বাষ্পচাপ',
      'আপেক্ষিক আর্দ্রতা ও শিশিরাংক...'
    ]
  },
  'Physics 2nd Paper': {
    'তাপগতিবিদ্যা': [
      'তাপীয় সূত্র',
      'থার্মোমিটার',
      'কৃতকাজ',
      'কার্নো ইঞ্জিন ও কার্নো চক্র',
      'এন্ট্রপি',
      'তাপগতীয় প্রক্রিয়া',
      'কৃষ্ণবস্তু'
    ],
    'স্থির তড়িৎ': [
      'চার্জ',
      'কুলম্বের সূত্র',
      'তড়িৎ - ক্ষেত্র,প্রাবল্য',
      'তড়িৎ বিভব',
      'ধারক',
      'তড়িৎ ফ্লাক্স ও গাউসের সূত্র',
      'তড়িৎ দ্বিমেরু'
    ],
    'চল তড়িৎ': [
      'রোধ',
      'তড়িৎশক্তি থেকে তাপ',
      'তড়িৎশক্তি ও ক্ষমতা',
      'ও\'মের সূত্র',
      'বর্তনী',
      'কার্শফের সূত্র',
      'শান্ট,মিটার ব্রিজ . হুইটস্টোন ব্রি...'
    ],
    'তড়িৎ প্রবাহের চৌম্বক ক্রিয়া ...': [
      'চৌম্বক ক্ষেত্রের ধারণা ও বায়ো স্যা...',
      'আম্পিয়ারের সূত্র ও চৌম্বকক্ষেত্রে...',
      'স্থায়ী ও অস্থায়ী চুম্বক',
      'পৃথিবীর চৌম্বকক্ষেত্র ও উপাদান',
      'ইলেকট্রন স্পিন ও চৌম্বকক্ষেত্র'
    ],
    'তড়িৎচৌম্বকীয় আবেশ': [
      'দিক পরিবর্তী প্রবাহ',
      'চৌম্বকের সাহায্যে শক্তি ও চৌম্ব...',
      'ফ্যারাডে ও লেন্জের সূত্র',
      'স্বকীয় ও পারস্পরিক আবেশ',
      'ট্রান্সফরমার'
    ],
    'জ্যামিতিক আলোকবিজ্ঞান': [
      'আলোর প্রতিসরণ ও প্রতিফলন',
      'প্রতিসরণাঙ্ক সংক্রান্ত',
      'লেন্স ও দর্পণ',
      'প্রতিবিম্ব',
      'চোখের ত্রুটি',
      'ফার্মাটের নীতি',
      'প্রিজম',
      'মাইক্রোস্কোপ ও টেলিস্কোপ'
    ],
    'ভৌত আলোকবিজ্ঞান': [
      'তড়িৎচৌম্বকীয় তরঙ্গ ও বর্ণালী',
      'হাইগেন্সের নীতি',
      'ব্যতিচার ও সমবর্তন',
      'ইয়ং এর পরীক্ষা',
      'অপবর্তন ও অপবর্তন গ্রেটিং'
    ],
    'আধুনিক পদার্থ বিজ্ঞান': [
      'আপেক্ষিকতার তত্ত্বের ধারনা',
      'সময় সম্প্রসারণ,দৈর্ঘ্য সংকোচন ও ভ...',
      'ভর-শক্তির সম্পর্ক',
      'কোয়ান্টাম পদার্থবিজ্ঞানের ধারনা',
      'ডি ব্রগলি',
      'এক্স রে',
      'আলোক তড়িৎ ক্রিয়া',
      'কম্পটন ক্রিয়া'
    ],
    'পরমাণুর মডেল ও নিউক্লিয়া...': [
      'পরমানু মডেল',
      'ব্যাসার্ধ,বেগ,ইলেকট্রনের শক্তি',
      'তেজস্ক্রিয়তা ও তেজস্ক্রিয় রশি',
      'ক্ষয় সূত্র,অর্ধায়ু ও গড় আয়ু',
      'নিউক্লিয় শক্তি , ভরত্রুটি, বন্ধন শক্তি',
      'নিউক্লিয় বিক্রিয়া'
    ],
    'সেমিকন্ডাক্টর ও ইলেকট্রনিক্স': [
      'অর্ধপরিবাহীর ধারনা ও প্রকারভেদ',
      'ডায়োড ও ডায়োডের প্রয়োগ',
      'ট্রানজিস্টর ও ট্রানজিস্টরের প্রয়োগ',
      'সংখ্যা পদ্ধতি',
      'লজিক গেট'
    ],
    'জ্যোতির্বিজ্ঞান': [
      'মহাবিশ্বের মূল বস্তুরসমূহ',
      'মহাবিশ্বের সৃষ্টি ও পরিনতি',
      'বিভিন্ন কণা ও রশি',
      'নক্ষত্র',
      'টেলিস্কোপ ও কৃত্রিম উপগ্রহ'
    ]
  },
  'Chemistry 1st Paper': {
    'ল্যাবরেটরির নিরাপদ ব্যবহার': [
      '১.১ - পোশাক,নিরাপদ গ্লাস,মাস্ক ...',
      '১.২- গ্লাস সামগ্রী ব্যবহার এর নিরাপ...',
      '১.৩- ল্যাবরেটরি, যন্ত্রপাতি ও গ্লা...',
      '১.৪- পল বুঙ্গী, ডিজিটাল ব্যালান্স',
      '১.৫- মেজারিং সিলিন্ডার বুরে...',
      '১.৬- বুনসেন বার্নার, রিয়েজেন্ট বোতল',
      '১.১০- ল্যাবরেটরি এর নিরাপত্তা ...'
    ],
    'গুণগত রসায়ন': [
      'পরমাণুর ভর ও আপেক্ষিক পারমাণবি...',
      'মৌলের তেজস্ক্রিয়তা ও তেজস্ক্রী...',
      '২.১ রাদারফোর্ড, বোর পরমাণু মডেল',
      '২.২ কোয়ান্টাম সংখ্যা, উপস্ত...',
      '২.৩ কোয়ান্টাম উপস্তর এর শক্তিক্র...',
      '২.৪ আউফবাউ, হুন্ড,পাউলির নীতি',
      '২.৫তড়িৎ চৌম্বক বর্ণালী, পরমাণু রে...',
      '২.৬ হাইড্রোজেন বর্ণালী',
      '২.৭ UV রশি, জাল টাকা, IR র...',
      'শিখা পরীক্ষা',
      '২.৮ দ্রাব্যতা গুণফল ও নীতি',
      '২.৯ দ্রবণ আয়ন এর উপস্থিতি',
      '২.১০ কেলাসন',
      '২.১১ পা তন, আংশিক পাতন, বাষ্প ...',
      '২.১২ দ্রাবক নিষ্কাশন',
      '২.১৩ CHROMATOGRAPHY',
      'গুণগত রসায়নের অন্যান্য'
    ],
    'মৌলের পর্যায়বৃত্ত ধর্ম ও রাসায়নি...': [
      '৩.১ ইলেকট্রন বিন্যাস এর ভিত্তি...',
      '৩.২ ব্লক মৌলের সাধারণ ধর্মাবলী',
      '৩.৩ পর্যায়বৃত্ত ধর্ম',
      '৩.৪ আয়নিকরণ শক্তি, ইলেক্ট্র...',
      '৩.৫ মৌলের অক্সাইডের অম্ল ক্ষারক ধর্ম',
      '৩.৬ মৌলের পর্যায় বৃত্ত ধর্ম এ...',
      '৩.৭ অরবিটাল এর অধিক্রমণ',
      '৩.৮ সমযোজী বন্ধন এর শ্রেণীবিভাগ',
      '৩.৯ সংকর অরবিটাল এর প্রকারভেদ',
      '৩.১০ সংকর অবস্থা নির্ণয়',
      '৩.১১ সংকর অরবিটাল এর সা...',
      '৩.১২ অণুর আকৃতি ও বন্ধন কোণে...',
      '৩.১৩ নিঃসঙ্গ ইলেকট্রন জোড় ...',
      '৩.১৪ সন্নিবেশ সমযোজী বন্ধন',
      '৩.১৫ পোলারিটি ও পোলারায়ন',
      '৩.১৬ সমযোজী এর আয়নুিক ...',
      '৩.১৭ ফাজান এর নীতি',
      '৩.১৮ ভান্ডার ওয়ালস বল',
      '৩.১৯ হাইড্রোজেন বন্ধন ও এর গুরুত্ব',
      'অজৈব যৌগের নামকরণ'
    ],
    'রাসায়নিক পরিবর্তন': [
      '৪.১ রাসায়নিক বিক্রিয়া ও গ্রি...',
      '৪.২ বিক্রিয়ার দিক( উভমুখী ও একমুখী)',
      '৪.৩ বিক্রিয়া হার, হার ধ্রুবক',
      '৪.৪ সাম্যাবস্থা ও সাম্যাবস্থা এ...',
      '৪.৫ লা শাতেলিয় নীতি ও শি...',
      'ভর ক্রিয়া সূত্র, Kc,Kp',
      '৪.৭ সাম্য ধ্রুবক ও Kc,Kp এর ম...',
      '৪.৮ পানির আয়নুিক গুণফল(Kw)',
      '৪.৯ অ্যাসিড ও ক্ষার বিয়োজ...',
      '৪.১০ সম আয়ন প্রভাব',
      '৪.১১ অ্যাসিড ক্ষার তীব্রতা ও বিয়োজ...',
      '৪.১২ pH ও ph scale',
      '৪.১৩ বাফার দ্রবণ ও এর ক্রিয়া কৌশল',
      '৪.১৪ মানুষের রক্ত, কৃষি, রসায়ন শি...',
      '৪.১৭ তাপীয় পরিবর্তন',
      '৪.১৮ তীব্র অ্যাসিড ও তীব্র ক্ষার প্রশ...',
      '৪.১৯ বিক্রিয়া তাপ ও বন্ধন শক্তি',
      '৪.২০ লাভয়সিয়ে ও হেসের সূত্র'
    ],
    'কর্মমুখী রসায়ন': [
      '৫.১ খাদ্য নিরাপত্তা ও রসায়ন',
      '৫.২ অনুমোদিত প্রিজারভেটিভস এ...',
      '৫.৩ খাদ্য কৌটাজাতকরণ',
      '৫.৪ দেশী ফলের, মাছ মাংস, টমে...',
      '৫.৫ সাসপেনশন, কোয়াগুলেশন',
      '৫.৬ দুধ, মাখন, ঘি',
      '৫.৭ টয়লেট্রিজ ও পারফিউম',
      '৫.৮ গ্লাস ক্লিনার, টয়লেট ক্লিনার প্রস্ত...',
      '৫.৯ ইথানয়িক অ্যাসিড থেকে ভিনেগার',
      '৫.১০ আখের রস থেকে ভিনেগার',
      '৫.১১ ভিনেগার এর খাদ্য সংরক্ষ...',
      '৫.১২ খাদ্যদ্রব্য সংরক্ষণে ভিনেগার এ...'
    ]
  },
  'Chemistry 2nd Paper': {
    'পরিবেশ রসায়ন': [
      '১.১ বায়ুমণ্ডল এর গঠন, উপাদান',
      '১.২ ঘূর্ণিঝড় ও জলোচ্ছ্বাস',
      '১.৩ গ্যাসীয় অবস্থা ও গঠনের বৈশিষ্ট্য',
      '১.৪ বয়েল, চার্লস ও avogadro এ...',
      '১.৫ বয়েল চার্লস এর সমন্বয় সূ...',
      '১.৬ গ্যাস এর আংশিক চাপ ও ডাল্ট...',
      '১.৭ গ্রাহাম এর সূত্র : গ্যাস এর ব্যাপ...',
      '১.৮ গ্যাস এর আণবিক গতিত...',
      '১.৯ আদর্শ ও বাস্তব গ্যাস',
      '১.১০ আমাগা লেখচিত্র ...',
      '১.১১ ভ্যান্ডার ওয়ালস ইকুয়েশন',
      '১.১২ গ্যাস সিলিন্ডার করণে গ্যা...',
      '১.১৩ বজ্রপাত এ বায়ুমণ্ডল ও মাটি...',
      '১.১৪ শিল্পের গ্যাসীয় বর্জ্য ও গ্রি...',
      '১.১৫ CFC গ্যাস ও ওজন স্ত...',
      '১.১৬ আরহেনিয়াস সমীকরণের...',
      '১.১৭ অনুবন্ধি অম্ল ক্ষারক',
      '১.১৮ মিঠা পানি, পানি দূষণ,পানি...'
    ],
    'জৈব যৌগ': [
      '২.১ জৈব যৌগ, অজৈব যৌগ, কার্ব...',
      '২.২ কার্যকরী মূলক , কার্যকরী মূলকে...',
      '২.৩ জৈব যৌগ এর নামকরণ',
      '২.৪ সমানুকরণ : জ্যামিতিক ...',
      '২.৫ বন্ধন বিভাজন, বিকার...',
      '২.৬ aromaticity ও হাকেল ত...',
      '২.৭ বেনজিন চক্রে প্রতিস্থাপক এ...',
      '২.৮ টলুইন',
      '২.৯ alkyl halide+ SN1,SN 2, E ...',
      '২.১০ হ্যালোফরম ,অ্যালকোহ...',
      '২.১১ ইথার, কার্বনিল যৌ...',
      '২.১২ জৈব অ্যাসিড ও জাতক',
      '২.১৩ amine, ডায়াজেনিয়াম সল্ট',
      '২.১৫ পলিমার',
      '২.১৬ প্লাস্টিসিটি',
      '২.১৭ glycoside ও পেপটাইড বন্ধন',
      '২.১৪ nitro গ্লিসারিন, TNT, ডেট...'
    ],
    'পরিমাণগত রসায়ন': [
      '৩.১ রাসায়নিক গণনা ও গ্যাসে...',
      '৩.২ রাসায়নিক সমীকরণ থেকে উৎপ...',
      '৩.৩ বিক্রিয়ক এর ভর থেকে উৎপা...',
      '৩.৪ মোলার ঘনমাত্রা বা মোলারি...',
      '৩.৫ অ্যাসিড ক্ষার প্রশমন বিক্রিয়া ...',
      '৩.৬ জারণ বিজারণ বিক্রিয়া',
      '৩.৭ জারণ সংখ্যা , জারণ ক্ষমতা ...',
      '৩.৮ নির্দেশক',
      '৩.৯ টাইট্রেশন',
      '৩.১০ iodimetry and iodometry',
      '৩.১১ বিয়ার lambert',
      '৩.১৩ HPLC, GC'
    ],
    'তড়িৎ রসায়ন': [
      '৪.১ তড়িৎ পরিবাহী ও এর প্রকারভেদ',
      '৪.২ তড়িৎ বিশ্লেষণ এর পরিবাহিতা',
      '৪.৩ ফ্যারাডে এর প্রথম সূত্র',
      '৪.৪ ধাতুর সক্রিয়তা সূত্র',
      '৪.৫ জারণ ও বিজারণ অর্ধবিক্রিয়া',
      '৪.৬ তড়িৎ দার বিভব এবং ধাতু...',
      '৪.৭ redox বিক্রিয়া, কোষ বিভব ...',
      '৪.৮ তড়িৎ দার ও কোষের বিভ...',
      '৪.৯ তড়িদদাড় ও এর প্রকারভেদ',
      '৪.১০ এক ও দুই প্রকোষ্ঠ বিশিষ্ট তড়ি...',
      '৪.১২ লেড স্টোরেজ ও লিথিয়া...',
      '৪.১৩ ফুয়েল সেল ও এর প্রকারভেদ',
      '৪.১৪ হাইড্রোজেন ফুয়েল সেল'
    ],
    'অর্থনৈতিক রসায়ন': [
      '৫.১ বাংলাদেশ এর গ্যাস ক্ষেত্র',
      '৫.২ বাংলাদেশ এর কয়লা ক্ষেত্র',
      '৫.৩ জ্বালানি সম্পদের এর প্রেক্ষি...',
      '৫.৪ বাংলাদেশে উল্লেখযোগ্য রসায়...',
      '৫.৫ ইউরিয়া, কাঁচ, সিরামিক, pul...',
      '৫. ৬ চামড়া ট্যানিং',
      '৫.৭ সিমেন্ট,ইউরিয়া,চামড়া, টেক্সটাই...',
      '৫.৮ বায়ু দূষণ নিয়ন্ত্রণ,ETP',
      '৫.৯ আয়রন,অ্যালুমিনিয়াম, কপা...',
      '৫.১০ নানো পার্টিকেল',
      '৫.১১ শিল্প ক্ষেত্রে nano পার্টিকেল'
    ]
  },
  'Higher Math 1st Paper': {
    'ম্যাট্রিক্স ও নির্ণায়ক': [
      'ম্যাট্রিক্স ও ম্যাট্রিক্সের প্রকারভেদ',
      'ম্যাট্রিক্স এর যোগ, বিয়োগ ও গুণ',
      'নির্ণায়ক, ব্যতিক্রমী ও অব্যতিক্রম...',
      'বিপরীত ম্যাট্রিক্স',
      'ক্রেমারের নিয়ম'
    ],
    'ভেক্টর': [
      'ভেক্টরের যোগ ও বিয়োগ',
      'একক ভেক্টর সম্পর্কিত',
      'ভেক্টরের ডট-ক্রস গুণ',
      'অভিক্ষেপ ও উপাংশ'
    ],
    'সরলরেখা': [
      'কার্তেসীয় ও পোলার স্থানাঙ্ক',
      'রেখা বিভাজন ও অনুপাত',
      'ত্রিভুজের ক্ষেত্রফল',
      'সরলরেখার সঞ্চারপথ',
      'লম্ব ও সমান্তরাল বিষয়ক',
      'সরলরেখার সমীকরণ',
      'কোণের সমদ্বিখণ্ডক , অন্তর্ভুক্ত কো...'
    ],
    'বৃত্ত': [
      'বৃত্তের সমীকরণ ও পোলার সমীকরণ...',
      'বৃত্ত ও সরলরেখা মিশ্রণ',
      'বৃত্তের সাপেক্ষে বিন্দুর অবস্থান',
      'স্পর্শক , অভিলম্ব ও সাধারণ ...'
    ],
    'বিন্যাস ও সমাবেশ': [
      'ফ্যাক্টরিয়াল বিষয়ক',
      'বিন্যাস বিষয়ক',
      'পুনরাবৃত্তি ও চক্রাকার বিন্যাস',
      'nCr ও সম্পূরক সমাবেশ বিষয়ক',
      'সমাবেশ বিষয়ক',
      'বিন্যাস ও সমাবেশ মিশ্রণ'
    ],
    'ত্রিকোণমিতিক অনুপাত': [
      'ত্রিকোণমিতিক কোণের মধ্যে সম্পর্ক',
      'ত্রিকোণমিতিক অনুপাত অন্যান্য',
      'ঘড়ির কাটা সম্পর্কিত'
    ],
    'সংযুক্ত ও যৌগিক কোণে...': [
      'মান নির্ণয়',
      'ত্রিকোণমিতিক সূত্রাবলী ও ত্রিভুজে...',
      'ত্রিকোণমিতির অন্যান্য'
    ],
    'ফাংশন ও ফাংশনের লেখচিত্র': [
      'অন্বয় এবং ডোমেন ও রেঞ্জ',
      'ফাংশন ও স্কেচ এবং ত্রিকোণমিতি...',
      'ফাংশনের মান নির্ণয়',
      'সংযোজিত ফাংশন',
      'বিপরীত ফাংশন'
    ],
    'অন্তরীকরণ': [
      'লিমিট',
      'ত্রিকোণমিতিক ফাংশনের অন্তরজ',
      'গুণফল ,ভাগফল ও সংযোজিত...',
      'বিপরীত ফাংশন ও পরামিতি...',
      'U^V আকারের ফাংশনের অন্তরজ',
      'অব্যক্ত ফাংশন (Implicit Function)',
      'পর্যায়ক্রমিক অন্তরজ (Successiv...',
      'স্পর্শক ও অভিলম্ব বিষয়ক',
      'লঘুমান গুরুমান বিষয়ক',
      'অন্তরীকরণ এর অন্যান্য'
    ],
    'যোগজীকরণ': [
      'বিভিন্ন সূত্রের ব্যবহারে যোগজীকরণ',
      'প্রতিস্থাপন পদ্ধতি (Method ...',
      'ত্রিকোণমিতিক ফাংশনে...',
      'UV আকারের (Integration b...',
      'intigration of Rational Algebra...',
      'নির্দিষ্ট যোগজ',
      'পরমমান সংক্রান্ত',
      'ক্ষেত্রফল নির্ণয়',
      'যোগজীকরণ এর অন্যান্য'
    ]
  },
  'Higher Math 2nd Paper': {
    'বাস্তব সংখ্যা ও অসমতা': [
      'বাস্তব সংখ্যার স্বীকার্য',
      'পরমমান বিষয়ক',
      'অসমতা সংক্রান্ত'
    ],
    'যোগাশ্রয়ী প্রোগ্রাম': [
      'যোগাশ্রয়ী প্রোগ্রাম'
    ],
    'জটিল সংখ্যা': [
      'জটিল সংখ্যা ও জ্যামিতিক প্রতিরূপ',
      'পরমমান (Modulus)',
      'নতি (Argument)',
      'জটিল সংখ্যার ধর্মাবলি',
      'বর্গমূল , ঘনমূল,চতুর্মূল এবং ষষ্ঠমূ...',
      'i বিষয়ক',
      'Omega বিষয়ক',
      'সঞ্চারপথ ও সমীকরণ সমাধান',
      'জটিল সংখ্যার অন্যান্য'
    ],
    'বহুপদী ও বহুপদী সমীকরণ': [
      'দ্বিঘাত ও ত্রিঘাত সমীকরণ সংক্রান্ত',
      'নিশ্চায়ক সংক্রান্ত',
      'সাধারণ মূল সংক্রান্ত',
      'প্রতিসম মূল সংক্রান্ত',
      'মূলগুলো সমান্তর ও গুণোত্তর ক্রমান্বয়ে',
      'সর্বোচ্চ ও সর্বনিম্ন মান'
    ],
    'দ্বিপদী বিস্তৃতি': [
      'সাধারণ পদ , মধ্যপদ ও সমদূরবর্তী ...',
      'x^n এর সহগ নির্ণয় বিষয়ক',
      'x বর্জিত পদ',
      'ধারা',
      'বৃহত্তম ও ক্ষুদ্রতম পদ',
      'অসীম ধারা, অভিসৃতি এবং আংশি...'
    ],
    'কণিক': [
      'কণিক নির্ণয়',
      'পরাবৃত্ত',
      'উপবৃত্ত',
      'অধিবৃত্ত',
      'ক্ষেত্রফল নির্ণয়'
    ],
    'বিপরীত ত্রিকোণমিতিক ফাংশন ...': [
      'বিপরীত ত্রিকোণমিতিক ফাংশন ...',
      'বিপরীত ত্রিকোণমিতিক ফাংশনে...',
      'সমীকরণ সমাধান'
    ],
    'স্থিতিবিদ্যা': [
      'দুইটি বলের লব্ধির মান ও কোণ',
      'লম্বাংশ এবং ত্রিভুজ ও বহুভুজ সূত্র',
      'পরিকেন্দ্র,ভরকেন্দ্র,লম্বকেন্দ্র ...',
      'বলজোটের সাম্যবস্থা ও লামির উপপা...',
      'সমান্তরাল বলের ক্ষেত্রে লব্ধি সংক্রা...'
    ],
    'সমতলে বস্তুকণার গতি': [
      'লব্ধি বেগ',
      'নদী ও স্রোত সংক্রান্ত',
      'আপেক্ষিক বেগ সংক্রান্ত ও বৃষ্টি ছাতা',
      'গতির সূত্রাবলীর ব্যবহার সংক্রান্ত',
      'বুলেটের তক্তা ভেদ সংক্রান্ত',
      'প্রাস সংক্রান্ত',
      'উলম্ব গতি সংক্রান্ত ও পড়ন্ত বস্তু'
    ],
    'বিস্তার পরিমাপ ও সম্ভাবনা': [
      'পরিসর , গড় , মধ্যমা ও প্রচুরক',
      'পরিমিত ব্যবধান,চতুর্থক ব্যবধান ও গ...',
      'পরিসরাঙ্ক , চতুর্থক ও গড় ব্যবধানাসং...',
      'সম্ভাবনার সাধারণ সমস্যা',
      'মুদ্রা নিক্ষেপ',
      'ছক্কা নিক্ষেপ',
      'তাস বিষয়ক',
      'পাস-ফেল বিষয়ক'
    ]
  }
};
